; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	spectrograph3 - mode
	Star1 - direction
	Star6 - direction
	Star5 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation2 - direction
	Star3 - direction
	Star0 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star5)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star8)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star5)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet13)
	(supports instrument9 thermograph1)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 thermograph2)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star7)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star8)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet13)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 Phenomenon9)
	(pointing satellite3 GroundStation2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 spectrograph3)
	(have_image Star11 thermograph1)
	(have_image Star12 spectrograph3)
	(have_image Planet13 spectrograph3)
))

)

; plan
1. (turn_to satellite3 groundstation2 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 groundstation2)
   goals met: 1 of 8
2. (turn_to satellite2 phenomenon9 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 8
3. (turn_to satellite1 groundstation2 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 8
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
5. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 2 of 8
6. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 2 of 8
7. (take_image satellite1 planet10 instrument2 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 3 of 8
8. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 8
9. (turn_to satellite0 star5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star5)
   goals met: 4 of 8
10. (take_image satellite1 phenomenon9 instrument2 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 8
11. (turn_to satellite1 planet13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet13)
   goals met: 5 of 8
12. (take_image satellite1 planet13 instrument2 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 6 of 8
13. (turn_to satellite1 star11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
14. (take_image satellite1 star11 instrument2 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 7 of 8
15. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 7 of 8
16. (take_image satellite1 star12 instrument2 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 8 of 8
